In [4]:

import pandas as pd
series1 = pd.Series([4.5, 7.2, -5.3, 3.6],index=['d','b','a','c'])
series1

d    4.5
b    7.2
a   -5.3
c    3.6
dtype: float64

In [7]:
import numpy as np

In [8]:

np.reshape(np.arange(9),(3,3))

array([[0, 1, 2],
       [3, 4, 5],
       [6, 7, 8]])

In [17]:
df1 = pd.DataFrame(np.arange(9).reshape((3,3)),
                   index=['a','c','d'],
                   columns=['台北','台中','高雄']
                   )
display(df1)

display(df1.drop(index=["c"]))
display(df1.drop(columns=["台北"]))

   台北  台中  高雄
a   0   1   2
c   3   4   5
d   6   7   8

   台北  台中  高雄
a   0   1   2
d   6   7   8

   台中  高雄
a   1   2
c   4   5
d   7   8

In [26]:
df2 = pd.DataFrame(np.arange(16).reshape((4,4)),
             index=['台北','台中', '台南', '高雄'],
             columns=['one', 'two', 'three', 'four'])
df2

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [28]:

df2 = df2.rename(columns={'ONE':'one','TWO':'two','THREE':'three','FOUR':'four'})
df2

    one  two  three  four
台北    0    1      2     3
台中    4    5      6     7
台南    8    9     10    11
高雄   12   13     14    15

In [ ]:
df2["one"] >=2
display(df2[[True,False,True,True]])

In [ ]:
display(df2.drop(['台北'],axis=0))
display(df2.drop(axis=1,labels=['one']))
display(df2.drop(index=['台北']))
display(df2.drop(columns=['one']))